app/Models/GsbModel.php

    public function get_infos_utilisateur($login, $mdp)
    {
        // return $this->db->table('utilisateur')
        //     ->select('idUtilisateur, nom, prenom, login, utilisateur.idRole, role.libelleRole')
        //     ->join('role', 'role.idRole = utilisateur.idRole')
        //     ->where('login', $login)
        //     ->where('mdp', $mdp)
        //     ->get()
        //     ->getRowArray();

        return $this->db->table('infos_utilisateurs')
            ->where('login', $login)
            ->where('mdp', $mdp)
            ->get()
            ->getRowArray();
---
SELECT *
FROM `utilisateurs`
WHERE `login` = 'dandre'
AND `mdp` = 'oppg5'
SELECT *
FROM `infos_utilisateurs`
WHERE `login` = 'dandre'
AND `mdp` = 'Azerty123*'

    public function get_les_mois_disponibles($idUtilisateur)
    {
        return $this->db->table('fichefrais')
            ->select('CONCAT(annee,mois) AS "anneemois", annee, mois')
            ->where('idUtilisateur', $idUtilisateur)
            ->orderBy('annee', 'DESC')
            ->orderBy('mois', 'DESC')
            ->get()
            ->getResultArray();
---
SELECT CONCAT(annee, mois) AS "anneemois", `annee`, `mois`
FROM `fichefrais`
WHERE `idUtilisateur` = 'b13'
ORDER BY `annee` DESC, `mois` DESC

    public function get_id_ficheFrais($idUtilisateur, $annee, $mois)
    {
        return $this->db->table('fichefrais')
            ->select('fichefrais.idFiche, fichefrais.idEtat')
            ->where('fichefrais.idUtilisateur', $idUtilisateur)
            ->where('fichefrais.annee', $annee)
            ->where('fichefrais.mois', $mois)
            ->get()
            ->getRowArray();
---
SELECT `fichefrais`.`idFiche`, `fichefrais`.`idEtat`
FROM `fichefrais`
WHERE `fichefrais`.`idUtilisateur` = 'b13'
AND `fichefrais`.`annee` = '2026'
AND `fichefrais`.`mois` = '03'

    public function get_les_infos_ficheFrais($idFiche)
    {
        return $this->db->table('fichefrais')
            ->select('fichefrais.idFiche, fichefrais.idEtat, fichefrais.dateModif, fichefrais.nbJustificatifs, fichefrais.montantValide, etatfrais.libelle')
            ->join('etatfrais', 'fichefrais.idEtat = etatfrais.idetat')
            ->where('fichefrais.idFiche', $idFiche)
            ->get()
            ->getRowArray();
---
SELECT `fichefrais`.`idFiche`, `fichefrais`.`idEtat`, `fichefrais`.`dateModif`, `fichefrais`.`nbJustificatifs`, `fichefrais`.`montantValide`, `etatfrais`.`libelle`
FROM `fichefrais`
JOIN `etatfrais` ON `fichefrais`.`idEtat` = `etatfrais`.`idetat`
WHERE `fichefrais`.`idFiche` = '648'

    public function get_les_frais_forfait($idFiche)
    {
        return $this->db->table('lignefraisforfait')
            ->select('fraisforfait.idfraisforfait, fraisforfait.libelle, lignefraisforfait.quantite')
            ->join('fraisforfait', 'fraisforfait.idfraisforfait = lignefraisforfait.idFraisForfait')
            ->where('lignefraisforfait.idFiche', $idFiche)
            ->orderBy('lignefraisforfait.idFraisForfait', 'ASC')
            ->get()
            ->getResultArray();
---
SELECT `fraisforfait`.`idfraisforfait`, `fraisforfait`.`libelle`, `lignefraisforfait`.`quantite`
FROM `lignefraisforfait`
JOIN `fraisforfait` ON `fraisforfait`.`idfraisforfait` = `lignefraisforfait`.`idFraisForfait`
WHERE `lignefraisforfait`.`idFiche` = '957'
ORDER BY `lignefraisforfait`.`idFraisForfait` ASC

    public function get_les_frais_hors_forfait($idFiche)
    {
        return $this->db->table('lignefraishorsforfait')
            ->where('idFiche', $idFiche)
            ->get()
            ->getResultArray();
---
SELECT *
FROM `lignefraishorsforfait`
WHERE `idFiche` = '957'

    public function est_premier_frais_mois($idUtilisateur, $annee, $mois)
    {
        $row = $this->db->table('fichefrais')
            ->select('count(*) AS nblignesfrais')
            ->where('idUtilisateur', $idUtilisateur)
            ->where('annee', $annee)
            ->where('mois', $mois)
            ->get()
            ->getRowArray();
---
SELECT count(*) AS nblignesfrais
FROM `fichefrais`
WHERE `idUtilisateur` = 'b13'
AND `annee` = '2026'
AND `mois` = '03'

    public function dernier_mois_saisi($idUtilisateur)
    {
        $row = $this->db->table('fichefrais')
            ->select('max(CONCAT(annee,mois)) AS dernierAnneeMois')
            ->where('idUtilisateur', $idUtilisateur)
            ->get()
            ->getRowArray();
---
SELECT max(CONCAT(annee, mois)) AS dernierAnneeMois
FROM `fichefrais`
WHERE `idUtilisateur` = 'b13'

    public function get_les_id_frais_forfait()
    {
        return $this->db->table('fraisforfait')
            ->select('idfraisforfait')
            ->orderBy('idfraisforfait')
            ->get()
            ->getResultArray();
---
SELECT `idfraisforfait`
FROM `fraisforfait`
ORDER BY `idfraisforfait`

    public function cree_nouvelles_lignes_frais($idUtilisateur, $annee, $mois)
    {
        $dernierMois = $this->dernier_mois_saisi($idUtilisateur);
        $gsb_lib = new Gsb_lib();
        $num_annee = $gsb_lib->get_annee_from_anneemois($dernierMois);
        $num_mois = $gsb_lib->get_mois_from_anneemois($dernierMois);

        $laDerniereFiche = $this->get_id_ficheFrais($idUtilisateur, $num_annee, $num_mois);

        if ($laDerniereFiche != null && $laDerniereFiche['idEtat'] == 'CR') {
            $idDerniereFiche = $laDerniereFiche['idFiche'];
            $this->maj_etat_fiche_frais($idDerniereFiche, 'CL');
        }

        $resultat = $this->db->table('fichefrais')->insert([
            'idUtilisateur' => $idUtilisateur,
            'annee' => $annee,
            'mois' => $mois,
            'nbJustificatifs' => 0,
            'montantValide' => 0,
            'dateModif' => date('Y-m-d'),
            'idEtat' => 'CR'
        ]);

        $insertionsOK = true;
        if ($resultat) {
            // On récupère l'id de la fiche qui vient d'être créée
            $nouvelleFiche = $this->get_id_ficheFrais($idUtilisateur, $annee, $mois);
            $idNouvelleFiche = $nouvelleFiche['idFiche'];
            foreach ($this->get_les_id_frais_forfait() as $unIdFraisForfait) {
                $res = $this->db->table('lignefraisforfait')->insert([
                    'idFiche' => $idNouvelleFiche,
                    'idFraisForfait' => $unIdFraisForfait['idfraisforfait'],
                    'quantite' => 0
                ]);
---
INSERT INTO `fichefrais` (`idUtilisateur`, `annee`, `mois`, `nbJustificatifs`, `montantValide`, `dateModif`, `idEtat`) VALUES ('b13', '2026', '03', 0, 0, '2026-03-31', 'CR')
INSERT INTO `lignefraisforfait` (`idFiche`, `idFraisForfait`, `quantite`) VALUES ('957', 'ETP', 0)

    public function maj_frais_forfait($idFiche, array $lesFrais)
    {
        $majOK = true;
        foreach (array_keys($lesFrais) as $idFrais) {
            $res = $this->db->table('lignefraisforfait')->update(
                ['quantite' => $lesFrais[$idFrais]],
                ['idFiche' => $idFiche, 'idFraisForfait' => $idFrais]
            );
---
UPDATE `lignefraisforfait` SET `quantite` = '9'
WHERE `idFiche` = '648'
AND `idFraisForfait` = 'ETP'

    public function get_fiches_validees_comptable()
    {
        return $this->db->table('fichefrais f')
            ->select('
                f.idFiche,
                f.annee,
                f.mois,
                u.nom,
                u.prenom
            ')
            ->join('utilisateur u', 'u.idUtilisateur = f.idUtilisateur')
            ->where('f.idEtat', 'VA')
            ->orderBy('u.nom')
            ->orderBy('f.annee', 'DESC')
            ->orderBy('f.mois', 'DESC')
            ->get()
            ->getResultArray();
---
SELECT `f`.`idFiche`, `f`.`annee`, `f`.`mois`, `u`.`nom`, `u`.`prenom`
FROM `fichefrais` `f`
JOIN `utilisateur` `u` ON `u`.`idUtilisateur` = `f`.`idUtilisateur`
WHERE `f`.`idEtat` = 'VA'
ORDER BY `u`.`nom`, `f`.`annee` DESC, `f`.`mois` DESC

    public function get_fiches_en_attente_validation()
    {
        return $this->db->table('fichefrais f')
            ->select('f.idFiche, f.annee, f.mois, u.nom, u.prenom')
            ->join('utilisateur u', 'u.idUtilisateur = f.idUtilisateur')
            ->where('f.idEtat', 'CL')
            ->orderBy('u.nom')
            ->orderBy('f.annee', 'DESC')
            ->orderBy('f.mois', 'DESC')
            ->get()
            ->getResultArray();
---
SELECT `f`.`idFiche`, `f`.`annee`, `f`.`mois`, `u`.`nom`, `u`.`prenom`
FROM `fichefrais` `f`
JOIN `utilisateur` `u` ON `u`.`idUtilisateur` = `f`.`idUtilisateur`
WHERE `f`.`idEtat` = 'CL'
ORDER BY `u`.`nom`, `f`.`annee` DESC, `f`.`mois` DESC

    public function get_un_frais_hors_forfait($idFraisHF)
    {
        return $this->db->table('lignefraishorsforfait')
            ->where('idLigneFHF', $idFraisHF)
            ->get()
            ->getRowArray();
---
SELECT *
FROM `lignefraishorsforfait`
WHERE `idLigneFHF` = '2263'

    public function maj_libelle_frais_hors_forfait($idFraisHF, $nouveauLibelle)
    {
        return $this->db->table('lignefraishorsforfait')
            ->where('idLigneFHF', $idFraisHF)
            ->update(['libelle' => $nouveauLibelle]);
---
UPDATE `lignefraishorsforfait` SET `libelle` = 'REFUSE:taxi'
WHERE `idLigneFHF` = '2263'