app/Models/GsbModel.php

    public function get_les_mois_disponibles($idUtilisateur)
    {
        return $this->db->table('fichefrais')
            ->select('CONCAT(annee,mois) AS "anneemois", annee, mois')
            ->where('idUtilisateur', $idUtilisateur)
            ->orderBy('annee', 'DESC')
            ->orderBy('mois', 'DESC')
            ->get()
            ->getResultArray();
---
SELECT CONCAT(annee, mois) AS "anneemois", `annee`, `mois`
FROM `fichefrais`
WHERE `idUtilisateur` = 'a17'
ORDER BY `annee` DESC, `mois` DESC

    public function get_id_ficheFrais($idUtilisateur, $annee, $mois)
    {
        return $this->db->table('fichefrais')
            ->select('fichefrais.idFiche, fichefrais.idEtat')
            ->where('fichefrais.idUtilisateur', $idUtilisateur)
            ->where('fichefrais.annee', $annee)
            ->where('fichefrais.mois', $mois)
            ->get()
            ->getRowArray();
---
SELECT `fichefrais`.`idFiche`, `fichefrais`.`idEtat`
FROM `fichefrais`
WHERE `fichefrais`.`idUtilisateur` = 'a17'
AND `fichefrais`.`annee` = '2025'
AND `fichefrais`.`mois` = '11'

    public function get_les_infos_ficheFrais($idFiche)
    {
        return $this->db->table('fichefrais')
            ->select('fichefrais.idFiche, fichefrais.idEtat, fichefrais.dateModif, fichefrais.nbJustificatifs, fichefrais.montantValide, etatfrais.libelle')
            ->join('etatfrais', 'fichefrais.idEtat = etatfrais.idetat')
            ->where('fichefrais.idFiche', $idFiche)
            ->get()
            ->getRowArray();
---
SELECT `fichefrais`.`idFiche`, `fichefrais`.`idEtat`, `fichefrais`.`dateModif`, `fichefrais`.`nbJustificatifs`, `fichefrais`.`montantValide`, `etatfrais`.`libelle`
FROM `fichefrais`
JOIN `etatfrais` ON `fichefrais`.`idEtat` = `etatfrais`.`idetat`
WHERE `fichefrais`.`idFiche` = '621'

    public function get_les_frais_forfait($idFiche)
    {
        return $this->db->table('lignefraisforfait')
            ->select('fraisforfait.idfraisforfait, fraisforfait.libelle, lignefraisforfait.quantite')
            ->join('fraisforfait', 'fraisforfait.idfraisforfait = lignefraisforfait.idFraisForfait')
            ->where('lignefraisforfait.idFiche', $idFiche)
            ->orderBy('lignefraisforfait.idFraisForfait', 'ASC')
            ->get()
            ->getResultArray();
---
SELECT `fraisforfait`.`idfraisforfait`, `fraisforfait`.`libelle`, `lignefraisforfait`.`quantite`
FROM `lignefraisforfait`
JOIN `fraisforfait` ON `fraisforfait`.`idfraisforfait` = `lignefraisforfait`.`idFraisForfait`
WHERE `lignefraisforfait`.`idFiche` = '621'
ORDER BY `lignefraisforfait`.`idFraisForfait` ASC

    public function get_les_frais_hors_forfait($idFiche)
    {
        return $this->db->table('lignefraishorsforfait')
            ->where('idFiche', $idFiche)
            ->get()
            ->getResultArray();
---
SELECT *
FROM `lignefraishorsforfait`
WHERE `idFiche` = '621'

    public function est_premier_frais_mois($idUtilisateur, $annee, $mois)
    {
        $row = $this->db->table('fichefrais')
            ->select('count(*) AS nblignesfrais')
            ->where('idUtilisateur', $idUtilisateur)
            ->where('annee', $annee)
            ->where('mois', $mois)
            ->get()
            ->getRowArray();
---
SELECT count(*) AS nblignesfrais
FROM `fichefrais`
WHERE `idUtilisateur` = 'a131'
AND `annee` = '2025'
AND `mois` = '11'

    public function get_fiches_validees_comptable()
    {
        return $this->db->table('fichefrais f')
            ->select('
                f.idFiche,
                f.annee,
                f.mois,
                u.nom,
                u.prenom
            ')
            ->join('utilisateur u', 'u.idUtilisateur = f.idUtilisateur')
            ->where('f.idEtat', 'VA')
            ->orderBy('u.nom')
            ->orderBy('f.annee', 'DESC')
            ->orderBy('f.mois', 'DESC')
            ->get()
            ->getResultArray();
---
SELECT `f`.`idFiche`, `f`.`annee`, `f`.`mois`, `u`.`nom`, `u`.`prenom`
FROM `fichefrais` `f`
JOIN `utilisateur` `u` ON `u`.`idUtilisateur` = `f`.`idUtilisateur`
WHERE `f`.`idEtat` = 'VA'
ORDER BY `u`.`nom`, `f`.`annee` DESC, `f`.`mois` DESC

    public function updateMdpUtilisateur($idUtilisateur, $mdp)
    {
        return $this->db->table('utilisateur')->update(
                ['mdp' => $mdp, 'date_modif_mdp' => date('Y-m-d H:i:s')] , ['idUtilisateur' => $idUtilisateur]
            );
---
UPDATE `utilisateur` SET `mdp` = 'oppg5', `date_modif_mdp` = '2026-03-12 17:17:51'
WHERE `idUtilisateur` = 'a17'